Tekla Open API Reference for Tekla Structures 2025
IFC2X3_ParametricObject_RectangleHollowProfile Properties
The IFC2X3_ParametricObject_RectangleHollowProfile type exposes the following members.
Properties
Name | Description
Description
 The description of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Extrusion
 The extrusion vector.
 (Inherited from ReferenceModelObjectAttribute.)
InnerFilletRadius
 The inner fillet radius.
Name
 The name of the product.
 (Inherited from ReferenceModelObjectAttribute.)
ObjectType
 The object type of the product.
 (Inherited from ReferenceModelObjectAttribute.)
Origin
 The origin of the extrusion.
 (Inherited from ReferenceModelObjectAttribute.)
OuterFilletRadius
 The outer fillet radius.
ProfileName
 The name of the profile (often empty).
 (Inherited from ReferenceModelObjectAttribute.)
WallThickness
 The wall thickness.
XDim
 The X dimension.
xDir
 The X-axis direction.
 (Inherited from ReferenceModelObjectAttribute.)
YDim
 The Y dimension.
Top
See Also
Reference
IFC2X3_ParametricObject_RectangleHollowProfile Class
Tekla.Structures.Model.Collaboration Namespace